# Load Data

In [2]:
%load_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

# Domain, Entity, & Relational Integrity

##### Finding data duplicity and integrity, testing our tables using basic query knowledge from earler in the course.

In [3]:
%%sql
SELECT *
FROM SECTIONS
Limit 5

;

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70384, 'C01'),
 (2, 'AC 0011', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70385, 'C02'),
 (3, 'AC 0011', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70382, 'C03'),
 (4, 'AC 0011', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 29, -29, 0, 70291, 'C04'),
 (5, 'AC 0011', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 30, -30, 0, 70350, 'C05')]

In [23]:
%%sql

SELECT Day, Start, End, Meetings as Meeting
    FROM SCHEDULES
    JOIN SECTIONS USING (Meetings)
ORDER BY Day, Start
Limit 5

;

 * sqlite:///CourseData.db
Done.

[('F', '2014-09-05T08:00:00', '2014-09-05T09:15:00', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('F', '2014-09-12T08:00:00', '2014-09-12T09:15:00', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('F', '2014-09-19T08:00:00', '2014-09-19T09:15:00', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('F', '2014-09-26T08:00:00', '2014-09-26T09:15:00', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]"),
 ('F', '2014-10-03T08:00:00', '2014-10-03T09:15:00', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]")]

In [34]:
%%sql

SELECT primary_instructor, CRN, Term, Title
FROM sections
WHERE Title = 'Abstract Algebra'
ORDER BY Term, Primary_instructor
Limit 10


;

 * sqlite:///CourseData.db
Done.

[('Benjamin   Fine', 70045, 'Fall2014', 'Abstract Algebra'),
 ('Janet   Striuli', 76832, 'Fall2015', 'Abstract Algebra'),
 ('Joseph B.  Dennin', 75037, 'Fall2015', 'Abstract Algebra'),
 ('Paul   Baginski', 77029, 'Fall2016', 'Abstract Algebra'),
 ('Janet   Striuli', 71029, 'Fall2017', 'Abstract Algebra'),
 ('Janet   Striuli', 72944, 'Fall2017', 'Abstract Algebra'),
 ('Paul   Baginski', 72731, 'Fall2017', 'Abstract Algebra'),
 ('Shawn T.  Rafalski', 74029, 'Fall2018', 'Abstract Algebra')]

###### Below example shows flawed data in the data set

In [28]:
%%sql

SELECT Primary_instructor, Title, COUNT(*)
    FROM SECTIONS 
    GROUP BY Primary_instructor, Title
    HAVING 
    COUNT(*) > 1
    Limit 5
    ;

 * sqlite:///CourseData.db
Done.

[('01/20-05/08', 'Continuing Project', 2),
 ('09/02-12/30', 'Statistics for Life Sciences Lab', 3),
 ('Aaron Quinn  Weinstein', 'Introduction to American Politics', 3),
 ('Aaron R.  Van Dyke', 'Biochemistry I', 10),
 ('Aaron R.  Van Dyke', 'Biochemistry I Lab', 2)]